tap "atlassian/acli"
tap "caryll/tap"
tap "charmbracelet/tap"
tap "daipeihust/tap"
tap "farion1231/ccswitch"
tap "felixkratz/formulae"
tap "hacker1024/hacker1024"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "homeport/tap"
tap "jordond/tap"
tap "joshmedeski/sesh"
tap "koekeishiya/formulae"
tap "laishulu/cask-fonts"
tap "leoafarias/fvm"
tap "morantron/tmux-fingers"
tap "mrkai77/cask"
tap "olets/tap"
tap "phanorcoll/muxie"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "sst/tap"
tap "supabase/tap"
tap "tw93/tap"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Linter and formatter to improve copywriting, correct spaces, words between CJK
brew "autocorrect"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Arbitrary precision numeric processing language
brew "bc"
# Toolchain of the web
brew "biome"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Binary installation for rust projects
brew "cargo-binstall"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# High performance code minimap generator
brew "code-minimap"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Diff that understands syntax
brew "difftastic"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Open-source GitLab command-line tool
brew "glab"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Like cURL, but for gRPC
brew "grpcurl"
# Tool for glamorous shell scripts
brew "gum"
# Post-modern modal text editor
brew "helix"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Common error values for all GnuPG components
brew "libgpg-error"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# System to create Windows installers
brew "makensis"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# POSIX *nix fetch script using Nerdfonts
brew "nerdfetch"
# Port scanning utility for large networks
brew "nmap"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Command-line Git information tool
brew "onefetch"
# Development kit for the Java programming language
brew "openjdk@17"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Paste PNG into files
brew "pngpaste"
# Modern API client that lives in your terminal
brew "posting"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Rich git commit graph in your terminal
brew "serie"
# Hunt down social media accounts by username
brew "sherlock"
# Graphical command-line client for SSH
brew "sshs"
# Opinionated Lua code formatter
brew "stylua"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Auto-hinter for TrueType fonts
brew "ttfautohint"
# Terminal UI OS (Terminal Multiplexer)
brew "tuios"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Software to interact with Atlassian Cloud from the terminal
brew "atlassian/acli/acli"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# Switch your input method through terminal
brew "daipeihust/tap/im-select"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Outputs current CPU core and package temperatures on macOS
brew "hacker1024/hacker1024/coretemp"
# Creates screenshots based on terminal command output.
brew "homeport/tap/termshot"
# Terminal-based battery and energy monitor for macos and linux
brew "jordond/tap/jolt"
# Smart terminal session manager
brew "joshmedeski/sesh/sesh"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# mouseless terminal interaction
brew "morantron/tmux-fingers/tmux-fingers"
# Auto-expanding abbreviations manager for zsh, inspired by fish
brew "olets/tap/zsh-abbr"
# A fast and flexible tmux session manager for organizing, launching, and automating tmux workspaces with ease.
brew "phanorcoll/muxie/muxie"
# Supabase CLI
brew "supabase/tap/supabase"
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole"
# Command-line interface for 1Password
cask "1password-cli"
# Configuration manager for Claude Code, Codex, Gemini and OpenCode
cask "farion1231/ccswitch/cc-switch"
cask "font-fantasque-sans-mono"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-martian-mono"
cask "font-meslo-lg-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-noto-sans-symbols-2"
cask "laishulu/cask-fonts/font-sarasa-nerd"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Window manager
cask "loop"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Hardware-accelerated GPU terminal emulator
cask "rio"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Digital design and prototyping platform
cask "sketch"
vscode "1yib.svelte-bundle"
vscode "aaron-bond.better-comments"
vscode "adam-bender.commit-message-editor"
vscode "ahmadawais.shades-of-purple"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "andischerer.theme-atom-one-dark"
vscode "antfu.icons-carbon"
vscode "antfu.theme-vitesse"
vscode "ardenivanov.svelte-intellisense"
vscode "ashinzekene.nestjs"
vscode "astro-build.astro-vscode"
vscode "bierner.color-info"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "carloscuesta.sprinkles-vscode"
vscode "chakrounanas.turbo-console-log"
vscode "chrsolr.rose-pine-nvchad-theme"
vscode "codediagram.codediagram"
vscode "codeium.codeium"
vscode "crystal-spider.jsdoc-generator"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "fabian-hiller.pace-theme"
vscode "fabiospampinato.vscode-debug-launcher"
vscode "fivethree.vscode-svelte-snippets"
vscode "fronterior.biome-monorepo"
vscode "github.codespaces"
vscode "gruntfuggly.todo-tree"
vscode "hermitter.oh-lucy-vscode"
vscode "hyphenzero.catalyst-theme"
vscode "ibm.output-colorizer"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jasonnutter.search-node-modules"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "kunalhedaoo25.dark-as-darkula"
vscode "liviuschera.noctis"
vscode "lostintangent.thinking-in-code"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.symbols"
vscode "million.million-lint"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "naumovs.color-highlight"
vscode "nyxb.materialiconic-product-icons"
vscode "obkoro1.korofileheader"
vscode "omthemes.omthemes"
vscode "pflannery.vscode-versionlens"
vscode "philsinatra.nested-comments"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "prisma.prisma"
vscode "qvist.jetbrains-new-ui-dark-theme"
vscode "raillyhugo.one-hunter"
vscode "redhat.vscode-yaml"
vscode "rocketseat.theme-omni"
vscode "rohanmahen.aimless"
vscode "romanpeshkov.tailwind-nested"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "sdras.night-owl"
vscode "shardulm94.trailing-spaces"
vscode "stevensona.shader-toy"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "whizkydee.material-palenight-theme"
vscode "wicked-labs.wvsc-serendipity"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xyc.vscode-mdx-preview"
vscode "yoavbls.pretty-ts-errors"
cargo "cargo-deny"
cargo "cargo-generate"
cargo "cargo-nextest"
cargo "cargo-xwin"
cargo "create-tauri-app"
cargo "git-cliff"
cargo "git-graph"
cargo "rustowl"
cargo "sqlx-cli"
cargo "swc_cli"
cargo "tauri-cli"
cargo "tokei"
cargo "typos-cli"
cargo "zellij"
